IDEA StatiCa Open Model
LineSegment2D Constructor
Compatible with IDEA StatiCa Beta 21.0 - beta
Initializes a new instance of the LineSegment2D class
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public LineSegment2D()
Public Sub New
public:
LineSegment2D()
See Also
Reference
LineSegment2D Class
IdeaRS.OpenModel.Geometry2D Namespace